Ran Plan for project: `prod` dir: `opentofu` workspace: `prod`

<details><summary>Show Output</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement

OpenTofu will perform the following actions:

  # module.cloudflare-dns.cloudflare_dns_record.dns_record will be updated in-place
~ resource "cloudflare_dns_record" "dns_record" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2025-05-23T19:10:42Z" -> (known after apply)
        id                  = "228371bde09ff7188598f4df8a3b835c"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-05-25T12:59:03Z" -> (known after apply)
      ~ name                = "postgres.opentoucan.com" -> "postgres"
      ~ proxiable           = true -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
      ~ tags                = [] -> (known after apply)
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.hetzner-vps.hcloud_server.server must be replaced
-/+ resource "hcloud_server" "server" {
      ~ backup_window              = "06-10" -> (known after apply)
      ~ id                         = "64442170" -> (known after apply)
      ~ ipv4_address               = "188.245.85.170" -> (known after apply)
      + ipv6_address               = (known after apply)
      ~ ipv6_network               = "<nil>" -> (known after apply)
      - labels                     = {} -> null
      ~ location                   = "fsn1" -> (known after apply)
        name                       = "postgres"
      - placement_group_id         = 0 -> null
      ~ primary_disk_size          = 40 -> (known after apply)
      + ssh_keys                   = [ # forces replacement
          + "Jared",
        ]
      ~ status                     = "running" -> (known after apply)
        # (11 unchanged attributes hidden)

      - public_net {
          - ipv4         = 89499765 -> null
          - ipv4_enabled = true -> null
          - ipv6         = 0 -> null
          - ipv6_enabled = false -> null
        }
      + public_net {
          + ipv4         = 89499765
          + ipv4_enabled = true
          + ipv6         = (known after apply)
          + ipv6_enabled = false
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis-0:4141/lock?id=opentoucan%252Finfrastructure-config%252Fopentofu%252Fprod)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p prod
  ```
Plan: 1 to add, 1 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```